Revit 2026 API

# PointOnPlane Class

---

Define a ReferencePoint relative to a planar reference.

SystemObject Autodesk.Revit.DBPointElementReference Autodesk.Revit.DBPointOnPlane

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointOnPlane : PointElementReference
```
```vb
Public Class PointOnPlane
	Inherits PointElementReference
```
```cpp
public ref class PointOnPlane : public PointElementReference
```
```fsharp
type PointOnPlane =
    class
        inherit PointElementReference
    end
```

The PointOnPlane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Offset | Signed offset from the plane. |
|  | Position | The coordinates of the point (or its projection) on the plane. |
|  | XVec | The X-coordinate vector of the point, in the plane's coordinate system. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPlaneReference | The geometric plane reference. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidPlaneReference | Check whether a geometry reference corresponds to a referenceable plane. |
|  | NewPointOnPlane | Construct a PointOnPlane given a reference and a location in space. |
|  | SetPlaneReference | Change the geometric plane reference. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A ReferencePoint on a plane has its X and Y basis vectors parallel to the plane, but is free to rotate around its Z basis vector. It can lie on the plane or have an offset.

#### Reference

Autodesk.Revit.DB Namespace